In [2]:
#         Handling Missing Data     ##########
#     NaN value and None object

import numpy as np
import pandas as pd

In [2]:
vals1 = np.array([1, None, 3, 4])  # None is a singletone object, 
                                    # thus it results in array of objects
vals1

array([1, None, 3, 4], dtype=object)

In [3]:
# NaN  : Missing numerical data
# NaN is a special floating-point value (in standard IEEE floating-point representation)

vals2 = np.array([1, np.nan, 3, 4]) 
vals2.dtype

dtype('float64')

In [4]:
1 + np.nan

nan

In [6]:
np.nan * 0

nan

In [7]:
vals2.sum(), vals2.min(), vals2.max()  # NaN "infects" all operations

(nan, nan, nan)

In [8]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)  # ignore NaN values

(8.0, 1.0, 4.0)

In [9]:
# !! in Pandas None is casted with NaN if needed !!

pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [3]:
# operations with null - values

df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [4]:
df.dropna() # by default, all rows with null values are dropped!!

     0    1  2
1  2.0  3.0  5

In [5]:
df.dropna(axis='columns') # dropping columns

   2
0  2
1  5
2  6

In [6]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [7]:
df.dropna(axis='columns')  # by default: dropping if any value is null

   2
0  2
1  5
2  6

In [8]:
df.dropna(axis='columns', how='all')  # dropping if all values are null

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [9]:
df.dropna(axis='rows', thresh=3) # specify minimum number of not null values 
                                # that must be in the row, other rows are dropped

     0    1  2   3
1  2.0  3.0  5 NaN

In [10]:
# Filling null values

data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [11]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [12]:
# forward-fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [13]:
# back-fill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [14]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [15]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0